Revit 2027 API
MEPCurve.Diameter Property
The diameter of the MEP curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Diameter { get; }
Public ReadOnly Property Diameter As Double
	Get
public:
property double Diameter {
	double get ();
}
member Diameter : float with get
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the MEP curve's Shape is not round.
Remarks
This property is used to retrieve the diameter of the MEP curve.
See Also
Reference
MEPCurve Class
Autodesk.Revit.DB Namespace